#pragma once
#include <iostream>

using namespace std;


/*
### 研究线

#### 成功读上研究生
- 权重比：智商（60%）、情商（20%）、体质（10%）、编程能力（10%）
- 解释：读研究生主要依赖于学术能力和智商，情商和编程能力也有一定影响，体质影响较小。

#### 研究脑机接口，并将动物神经网络数据上传，上传成功
- 权重比：智商（50%）、编程能力（30%）、情商（10%）、体质（10%）
- 解释：脑机接口研究需要高智商和编程能力，情商和体质影响较小。

#### 研究脑际接口的时候，难以将人类情感数据化，坚持研发，且成功
- 权重比：智商（40%）、情商（30%）、编程能力（20%）、体质（10%）
- 解释：情感数据化研究需要智商、情商和编程能力的综合应用，体质影响较小。

### 工作线

#### 找到工作
- 权重比：情商（40%）、智商（30%）、编程能力（20%）、体质（10%）
- 解释：找到工作需要情商和智商，编程能力和体质也有一定影响。

#### 被裁员
- 权重比：情商（50%）、智商（20%）、编程能力（20%）、体质（10%）
- 解释：被裁员主要与情商和团队合作能力有关，智商和编程能力也有一定影响，体质影响较小。

#### 升职
- 权重比：情商（40%）、智商（30%）、编程能力（20%）、体质（10%）
- 解释：升职需要情商和智商，编程能力和体质也有一定影响。

### 创业线

### 触发创业
- 权重比： 情商（35%）、智商（30%）、编程能力（25%）、体质（10%）
- 解释： 触发创业需要高情商来建立团队和处理人际关系，高智商用于制定战略和解决问题，编程能力用于应对技术挑战，体质用于应对高强度的工作压力。

通过这样的权重比设定，可以更好地模拟触发创业所需的各方面能力，从而增加游戏的真实性和可玩性。

#### 确定企业所有权，是个人独资的话，创业的成功
- 权重比：情商（30%）、智商（30%）、编程能力（20%）、体质（20%）
- 解释：个人独资创业需要情商、智商、编程能力和体质的综合应用。

#### 是合伙创办的话，创业的成功
- 权重比：情商（40%）、智商（30%）、编程能力（20%）、体质（10%）
- 解释：合伙创业需要情商和智商，编程能力和体质也有一定影响。

#### 在创业中团队创建
- 权重比：情商（50%）、智商（20%）、编程能力（20%）、体质（10%）
- 解释：团队创建主要依赖于情商和团队合作能力，智商和编程能力也有一定影响，体质影响较小。

#### 自我培养人才，创业的成功
- 权重比：情商（40%）、智商（30%）、编程能力（20%）、体质（10%）
- 解释：自我培养人才需要情商和智商，编程能力和体质也有一定影响。

#### 直接挖业界精英墙角后，创业的成功
- 权重比：情商（40%）、智商（30%）、编程能力（20%）、体质（10%）
- 解释：挖业界精英需要情商和智商，编程能力和体质也有一定影响。

#### 确定创业方向
- 权重比：智商（40%）、情商（30%）、编程能力（20%）、体质（10%）
- 解释：确定创业方向需要智商和情商，编程能力和体质也有一定影响。

#### 是高科技领域中，创业成功
- 权重比：智商（50%）、编程能力（30%）、情商（10%）、体质（10%）
- 解释：高科技领域创业需要高智商和编程能力，情商和体质影响较小。

#### 日常需求领域（做市场上的互联网项目），创业的成功
- 权重比：情商（40%）、智商（30%）、编程能力（20%）、体质（10%）
- 解释：日常需求领域创业需要情商和智商，编程能力和体质也有一定影响。

### 失败线

#### 你因为英年早逝死亡了
- **权重比：** 体质（80%）、情商（10%）、智商（5%）、编程能力（5%）
- **解释：** 英年早逝主要与体质有关，其他属性影响较小。

#### 你草草的结束了自己的一生
- **权重比：** 体质（60%）、情商（20%）、智商（10%）、编程能力（10%）
- **解释：** 草草结束一生可能与体质和情商有关，智商和编程能力影响较小。

#### 你因干活勤练得到了外卖公司的股份
- **权重比：** 体质（50%）、情商（30%）、智商（10%）、编程能力（10%）
- **解释：** 得到股份主要依赖于体质和情商，智商和编程能力也有一定影响。

#### 你成为网红
- **权重比：** 情商（50%）、智商（20%）、编程能力（20%）、体质（10%）
- **解释：** 成为网红需要高情商来吸引观众和互动，智商和编程能力用于内容制作和技术支持，体质影响较小。

#### 快乐过完一生
- **权重比：** 情商（40%）、智商（20%）、编程能力（20%）、体质（20%）
- **解释：** 快乐过完一生需要情商和智商，编程能力和体质也有一定影响。

#### 你炒出了炒饭新概念，赚到了不少钱
- **权重比：** 智商（40%）、情商（30%）、编程能力（20%）、体质（10%）
- **解释：** 炒出新概念需要高智商和情商，编程能力用于可能的线上推广，体质影响较小。

#### 耗光了钱草草结束了一生
- **权重比：** 情商（40%）、智商（30%）、编程能力（20%）、体质（10%）
- **解释：** 耗光钱草草结束一生可能与情商和智商有关，编程能力和体质影响较小。
*/

#include<iostream>
#include<string>
#include<vector>
#include<map>
using namespace std;

//---------------------------锟斤拷锟斤拷锟斤拷锟?-----------------------------

/*
    锟斤拷示锟阶段ｏ拷锟斤拷同锟阶段会触锟斤拷锟斤拷同锟斤拷锟铰硷拷  锟斤拷锟矫诧拷同锟铰硷拷锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷媒锟斤拷锟斤拷锟斤拷锟?
    0锟斤拷示锟阶讹拷时锟斤拷 1锟斤拷示锟斤拷学时锟斤拷
    2锟斤拷示锟叫撅拷锟斤拷时锟斤拷 3锟斤拷示锟斤拷锟斤拷时锟斤拷
    4锟斤拷示锟斤拷业时锟斤拷 5锟斤拷示锟斤拷锟斤拷锟斤拷
    6锟斤拷示锟斤拷业锟斤拷 7锟斤拷示锟斤拷锟斤拷锟斤拷
    8锟斤拷示锟斤拷锟斤拷 9锟斤拷示锟斤拷锟斤拷
*/
int flag;


/*
    锟斤拷锟斤拷锟斤拷锟?
    锟斤拷锟戒、锟斤拷锟教★拷锟斤拷锟教★拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟?
*/
typedef struct
{
    int Age;//锟斤拷锟斤拷
    int IQ;//锟斤拷锟斤拷
    int EQ;//锟斤拷锟斤拷
    int ProgramingSkill;//锟斤拷锟斤拷锟斤拷锟?
    int Health;//锟斤拷锟斤拷
}person;


/*
    锟斤拷锟斤拷锟斤拷影锟斤拷 锟斤拷/锟斤拷
*/
typedef struct
{
    int IQBonus;
    int EQBonus;
    int ProgramingSkillBonus;
    int HealthBonus;
}Bonus;


/*
    锟斤拷锟斤拷锟铰硷拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷  锟斤拷{"IQ": 100, "CodingLevel": 80}
*/
typedef struct
{
    int IQ;
    int EQ;
    int ProgramingSkill;
    int Health;
}limit;


/*
    锟届赋锟斤拷锟斤拷
*/
typedef struct {
    int talentID; //锟届赋锟斤拷ID
    string description; //锟届赋锟斤拷锟斤拷
    Bonus talentBonus; //锟届赋锟斤拷锟斤拷锟皆碉拷影锟斤拷
}talent;


/*
    锟铰硷拷锟斤拷母锟斤拷锟?  锟斤拷锟斤拷锟斤拷锟斤拷锟叫憋拷示 锟斤拷锟节碉拷锟绞撅拷锟角帮拷录锟? 锟接节碉拷锟绞撅拷锟揭伙拷锟斤拷锟斤拷锟斤拷录锟斤拷锟窖★拷锟?
            锟斤拷没锟斤拷锟接节碉拷锟斤拷锟斤拷锟斤拷锟揭伙拷锟斤拷锥锟?
            锟斤拷只锟斤拷一锟斤拷锟接节碉拷锟斤拷直锟接凤拷锟绞革拷锟接节碉拷
            锟斤拷锟叫讹拷锟斤拷咏诘锟斤拷锟轿★拷锟斤拷锟斤拷录锟斤拷锟斤拷锟斤拷选锟斤拷 选锟斤拷锟斤拷俜锟斤拷矢媒诘锟?
            锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟絣imit 锟斤拷锟斤拷锟斤拷锟铰硷拷锟斤拷锟斤拷 锟斤拷么锟节点保锟街诧拷锟斤拷 锟铰硷拷锟斤拷展停锟斤拷 锟斤拷锟界：锟斤拷锟戒不锟斤拷25锟疥不锟结触锟斤拷锟襟厂诧拷员锟斤拷锟铰硷拷
    锟斤拷员锟斤拷锟斤拷锟斤拷锟铰硷拷锟斤拷锟斤拷 description   锟斤拷锟斤拷锟斤拷锟斤拷 limit锟斤拷锟斤拷锟斤拷锟铰硷拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟揭拷锟?
    锟铰硷拷锟斤拷锟接节碉拷 children 锟斤拷示
*/
class mainEvent
{
public:
    string description;           // 锟铰硷拷锟斤拷锟斤拷
    vector<mainEvent*> children;  // 锟斤拷锟铰硷拷锟节碉拷
    Bonus eventBonus; //锟斤拷示锟斤拷锟铰硷拷锟斤拷锟斤拷锟斤拷锟斤拷缘锟接帮拷锟?
    int triggerAge;  //锟斤拷锟斤拷枪潭锟斤拷录锟斤拷锟斤拷锟斤拷锟轿拷锟接︼拷锟斤拷锟斤拷洌拷锟斤拷锟斤拷录锟斤拷锟斤拷锟斤拷锟轿?1

    virtual ~mainEvent() {};
};


class interactiveEvent : public mainEvent {
public:
    void chooseEvent(person& person) {

    }
};

class rndEvent :public mainEvent {
public:
    bool shouldTrigger() {

    }
};


//锟斤拷示锟斤拷学锟阶讹拷锟铰硷拷 锟教筹拷
class UniversityEvent :public mainEvent {};

//锟斤拷示锟叫撅拷锟斤拷锟阶讹拷锟铰硷拷 锟教筹拷
class postgraduateEvent :public mainEvent {};


//锟斤拷示锟斤拷锟斤拷锟阶讹拷锟铰硷拷
class jobEvent :public mainEvent {};


//锟斤拷示锟斤拷业锟阶讹拷锟铰硷拷
class EnterpriseEvent :public mainEvent {};


//锟斤拷示失锟杰阶讹拷锟铰硷拷
class defeatEvent : public mainEvent {};


//锟斤拷示锟斤拷锟捷阶讹拷锟铰硷拷
class retireEvent : public mainEvent {};


/*
    锟斤拷示锟斤拷锟斤拷录锟?
    锟斤拷员锟斤拷锟斤拷锟斤拷锟铰硷拷锟侥憋拷示 锟铰硷拷锟斤拷效锟斤拷 锟斤拷锟斤拷锟侥革拷锟绞碉拷
*/

struct rndEvent
{
    string description;  // 锟铰硷拷锟斤拷锟斤拷锟斤拷锟斤拷锟界“突然锟矫帮拷症锟斤拷锟斤拷锟斤拷锟斤拷通锟铰故★拷
    Bonus effect;  // 锟铰硷拷效锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷俳锟斤拷锟街碉拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟?
    float probability;   // 锟铰硷拷锟斤拷锟斤拷锟侥革拷锟绞ｏ拷0锟斤拷1之锟斤拷
    //------------------------锟斤拷锟矫猴拷锟斤拷-------------------------------
};

/*
    锟斤拷示锟斤拷锟斤拷录锟斤拷募锟斤拷锟?
*/
vector<rndEvent> rndEvents;


/*
    锟斤拷示锟窖撅拷锟斤拷锟斤拷锟铰硷拷锟侥硷拷锟斤拷 每锟轿筹拷始锟斤拷时锟斤拷锟斤拷锟秸癸拷值锟斤拷锟较拷锟斤拷锟斤拷锟?
*/
vector<string> happenEvent;


/*
  锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
*/

// 锟斤拷锟斤拷锟斤拷锟?
typedef struct
{
    string description; // 锟斤拷值锟斤拷锟较革拷锟斤拷锟?
    int score; // 锟斤拷锟斤拷锟斤拷郑锟紸锟斤拷B锟斤拷C锟斤拷
    bool isHidden; // 锟角凤拷为锟斤拷锟截斤拷锟?锟斤拷锟斤拷锟斤拷锟揭恍╋拷实锟街拷锟侥憋拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷亟锟斤拷展锟街碉拷页锟芥不同
} Ending;

// 锟斤拷执锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷愿锟斤拷锟斤拷锟斤拷曰锟斤拷录锟斤拷锟斤拷瓒?
typedef struct
{
    limit endlimit;//锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟?
    vector<mainEvent> preevent;//锟斤拷示锟斤拷锟斤拷锟斤拷值锟斤拷锟斤拷锟揭拷锟斤拷锟斤拷锟角帮拷锟斤拷录锟?
} EndingCondition;

// 锟斤拷锟斤拷卸锟斤拷氪ワ拷锟?
typedef struct
{
    Ending ending; // 锟斤拷锟斤拷慕锟斤拷锟斤拷锟斤拷
    EndingCondition condition; // 锟斤拷锟斤拷锟矫斤拷值锟斤拷锟斤拷锟?
} EndingEvent;

//---------------------------锟斤拷锟斤拷锟斤拷锟?-----------------------------



//---------------------------service-------------------------------

/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷始锟斤拷锟斤拷锟斤拷录锟斤拷锟?
        锟斤拷始锟斤拷锟斤拷戏锟斤拷锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void

*/
void init();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟届赋锟斤拷锟斤拷锟皆碉拷影锟斤拷
            锟斤拷锟斤拷锟斤拷锟斤拷锟窖★拷锟斤拷锟届赋锟斤拷锟斤拷锟斤拷锟斤拷值锟斤拷锟斤拷锟睫革拷
    锟斤拷锟斤拷锟斤拷锟斤拷叶锟斤拷锟斤拷锟絫alentChooseView锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷旄筹拷锟絀D锟斤拷锟斤拷锟斤拷
    锟斤拷锟斤拷值锟斤拷void

*/
void TalentBonus(person, vector<int>);

/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷始锟斤拷锟斤拷锟斤拷录锟斤拷锟?
            锟斤拷randomEvents锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟铰硷拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void

*/
void initRandomEvents();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷锟铰硷拷锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷录锟?

*/
mainEvent* buildEventTree();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟铰硷拷循锟斤拷锟斤拷锟斤拷
            锟斤拷锟教讹拷锟铰硷拷>锟斤拷锟斤拷锟铰硷拷>锟斤拷锟斤拷录锟斤拷锟剿筹拷锟饺凤拷锟矫匡拷锟街伙拷锟斤拷锟揭伙拷锟斤拷录锟?
                while(age<100){
                    锟斤拷锟斤拷欠锟斤拷泄潭锟斤拷录锟?

                    没锟叫ｏ拷锟斤拷锟介交锟斤拷锟铰硷拷

                    没锟叫固讹拷锟铰硷拷锟斤拷锟斤拷锟斤拷锟铰硷拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷录锟?


                    锟铰硷拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟?

                    锟斤拷锟斤拷锟揭的斤拷锟斤拷值锟斤拷锟斤到锟斤拷锟斤拷锟斤拷锟斤拷时锟斤拷锟斤拷循锟斤拷
                }
            锟斤拷戏锟斤拷锟斤拷endView()
    锟斤拷锟斤拷锟斤拷锟斤拷叶锟斤拷锟絧layer锟斤拷锟斤拷前锟铰硷拷锟节碉拷currentEvent
    锟斤拷锟斤拷值锟斤拷void

*/
void gameLoop(person, mainEvent*);


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟絚heckRandomEvents()锟斤拷锟斤拷锟叫憋拷锟斤拷锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷锟斤拷锟缴碉拷锟斤拷锟斤拷锟?

*/
float generateRandom();

/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷generateRandom()锟斤拷锟斤拷锟斤拷锟缴碉拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟角否触凤拷锟斤拷锟斤拷录锟?
    锟斤拷锟斤拷锟斤拷锟斤拷叶锟斤拷锟?
    锟斤拷锟斤拷值锟斤拷void

*/
void checkRandomEvents(person);


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷锟斤拷锟斤拷锟铰硷拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void

*/
void handleInteractiveEvent();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷锟铰硷拷影锟斤拷锟睫革拷锟斤拷锟斤拷锟斤拷锟街?
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void

*/
void EventBonus();


//---------------------------service-------------------------------



//-----------------------------view--------------------------------

 /*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷始锟斤拷锟斤拷锟剿碉拷锟斤拷锟斤拷
            展示选锟斤拷选锟筋：
                锟斤拷录锟剿伙拷锟斤拷锟斤拷锟斤拷锟铰硷拷锟斤拷锟?
                注锟斤拷锟剿伙拷锟斤拷锟斤拷锟斤拷注锟斤拷锟斤拷锟?
                锟斤拷戏锟斤拷锟矫ｏ拷锟斤拷锟斤拷锟斤拷戏锟斤拷锟矫斤拷锟斤拷 //锟斤拷展
                锟剿筹拷锟斤拷戏锟斤拷锟剿筹拷锟斤拷锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void menuView();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷锟结供锟矫伙拷锟斤拷锟斤拷锟剿伙拷锟斤拷锟斤拷锟斤拷
        锟斤拷锟斤拷锟斤拷锟斤拷钮
        一锟斤拷锟角碉拷录锟斤拷钮  锟斤拷锟斤拷锟斤拷戏锟斤拷始锟斤拷锟斤拷
        一锟斤拷锟斤拷取锟斤拷锟斤拷钮 锟斤拷锟节凤拷锟斤拷锟斤拷锟剿碉拷锟斤拷锟斤拷锟斤拷锟斤拷锟剿碉拷页锟斤拷
    锟斤拷锟斤拷 void
    锟斤拷锟斤拷值 void
*/
void loginView();

/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷锟矫伙拷注锟斤拷锟剿猴拷
        锟斤拷锟斤拷锟斤拷锟斤拷钮一锟斤拷锟斤拷注锟斤拷 一锟斤拷锟角凤拷锟斤拷 锟斤拷锟竭撅拷锟斤拷锟斤拷锟斤拷锟斤拷录页锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void registerView();

/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷锟斤拷锟斤拷钮
        一锟斤拷锟角匡拷始锟斤拷戏锟侥帮拷钮锟斤拷锟斤拷榭拷锟斤拷锟?
        一锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷钮锟斤拷锟斤拷锟斤拷锟侥斤拷锟斤拷
        一锟斤拷锟角成就帮拷钮锟斤拷锟斤拷删徒锟斤拷锟?
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void gameBeignView();


/*

    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
      展锟斤拷锟届赋选锟斤拷
            锟斤拷锟矫伙拷选取锟届赋锟斤拷锟斤拷选取锟斤拷锟届赋锟斤拷锟斤拷3锟斤拷锟斤拷锟斤拷锟窖★拷锟?
            锟斤拷锟斤拷TalentBonus()锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟届赋锟睫革拷锟斤拷锟斤拷值
      锟斤拷一锟斤拷选锟斤拷钮 选锟斤拷之锟斤拷锟斤拷锟斤拷锟斤拷锟较凤拷锟斤拷锟?
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void talentChooseView();


/*
     锟斤拷锟斤拷锟剿ｏ拷
     锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷init()锟斤拷始锟斤拷锟斤拷戏锟斤拷锟斤拷
        锟斤拷锟斤拷锟斤拷示锟斤拷色锟斤拷锟斤拷 锟斤拷一些锟斤拷锟斤拷锟斤拷息
        锟斤拷示一锟斤拷锟侥憋拷锟斤拷锟斤拷锟斤拷展示锟窖撅拷锟斤拷锟斤拷锟斤拷锟铰硷拷 锟斤拷一些锟斤拷然锟铰硷拷
        锟斤拷锟斤拷一锟斤拷锟斤拷钮锟斤拷锟矫伙拷锟斤拷锟斤拷锟揭伙拷锟?
     锟斤拷锟斤拷锟斤拷void
     锟斤拷锟斤拷值锟斤拷 void
*/
void gameView();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷锟斤拷gameView锟侥伙拷锟斤拷锟斤拷展锟斤拷一锟斤拷小锟侥斤拷锟斤拷 锟斤拷锟斤拷展示
        1.锟斤拷锟斤拷录锟斤拷锟斤拷录锟斤拷锟斤拷锟斤拷锟斤拷锟?
        2.选锟斤拷锟铰硷拷锟斤拷锟铰硷拷锟斤拷锟斤拷 锟斤拷锟斤拷选锟斤拷选锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void popView();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷展锟斤拷锟斤拷锟矫斤拷锟斤拷  锟斤拷锟斤拷锟节达拷锟斤拷锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void settingView();


/*
      锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷展锟斤拷锟斤拷锟斤拷锟斤拷锟较凤拷锟斤拷乜锟斤拷拇锟斤拷锟?锟皆硷拷锟斤拷玫锟斤拷锟竭凤拷锟斤拷
        锟斤拷锟斤拷锟斤拷一锟斤拷锟斤拷钮锟斤拷锟节凤拷锟斤拷锟斤拷戏锟斤拷始锟斤拷锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void careerView();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷展锟斤拷锟斤拷锟斤拷锟斤拷锟矫成撅拷
        锟斤拷锟斤拷锟斤拷一锟斤拷锟斤拷锟截帮拷钮锟斤拷锟节凤拷锟斤拷锟斤拷戏锟斤拷始锟斤拷锟斤拷
    锟斤拷锟斤拷锟斤拷void
    锟斤拷锟斤拷值锟斤拷void
*/
void achievementView();


/*
    锟斤拷锟斤拷锟剿ｏ拷
    锟斤拷锟杰ｏ拷
        锟斤拷锟斤拷展示锟斤拷锟斤拷锟较凤拷锟斤拷锟斤拷锟斤拷锟斤拷锟侥斤拷锟?
        锟斤拷锟皆凤拷锟斤拷锟斤拷锟剿碉拷 锟斤拷锟斤拷锟斤拷锟铰匡拷始锟斤拷戏锟斤拷锟斤拷锟斤拷GameView锟斤拷
*/
void endView();


//-----------------------------view--------------------------------



